20260121072551-exponent_operations.org
:PROPERTIES:
:ID:       084b3f68-cbfa-4f4d-b3fb-724a5ae1391b
:END:
#+title: Exponent Operations

* Exponent Operations

- A [[id:9bcf2aef-060a-4011-98b5-cb949a9f7d1a][binary operator]]
The ~Math.pow(a, b)~ method can be used to compute $a^b$.

The =pow= method is defined in the *Math* class.

** Examples
~Math.pow(2, 3)~, which returns the result of $a^b$ i.e. ( $2^3$)


Here, ~a~ and ~b~ are parameters for the =pow= method and the numbers ~2~ and ~3~ are actual values used to invoke the method.

#+BEGIN_SRC java
System.out.println(Math.pow(2, 3)); // Displays 8.0
System.out.println(Math.pow(4, 0.5)); // Displays 2.0
System.out.println(Math.pow(2.5, 2)); // Displays 6.25
System.out.println(Math.pow(2.5, –2)); // Displays 0.16
#+END_SRC

| Method    | Description                                | Example                         |
|-----------+--------------------------------------------+---------------------------------|
| exp(x)    | Returns e raised to the power of x (e^x).  | Math.exp(1) → 2.718281828459045 |
| log(x)    | Returns the natural logarithm of x (ln x). | Math.log(Math.E) → 1.0          |
| log10(x)  | Returns the base-10 logarithm of x.        | Math.log10(100) → 2.0           |
| pow(a, b) | Returns a raised to the power of b (a^b).  | Math.pow(2, 3) → 8.0            |
| sqrt(x)   | Returns the square root of x (x ≥ 0).      | Math.sqrt(16) → 4.0             |
| cbrt(x)   | Returns the cube root of x.                | Math.cbrt(27) → 3.0             |
