20260121072551-exponent_operations.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 09:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Exponent Operations</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Exponent Operations</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0f3110a">1. Exponent Operations</a>
<ul>
<li><a href="#org8a50c7d">1.1. Examples</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0f3110a" class="outline-2">
<h2 id="org0f3110a"><span class="section-number-2">1.</span> Exponent Operations</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>A <a href="20231231060610-binary_operators.html#ID-9bcf2aef-060a-4011-98b5-cb949a9f7d1a">binary operator</a></li>
</ul>
<p>
The <code>Math.pow(a, b)</code> method can be used to compute \(a^b\).
</p>

<p>
The <code>pow</code> method is defined in the <b>Math</b> class.
</p>
</div>

<div id="outline-container-org8a50c7d" class="outline-3">
<h3 id="org8a50c7d"><span class="section-number-3">1.1.</span> Examples</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>Math.pow(2, 3)</code>, which returns the result of \(a^b\) i.e. ( \(2^3\))
</p>


<p>
Here, <code>a</code> and <code>b</code> are parameters for the <code>pow</code> method and the numbers <code>2</code> and <code>3</code> are actual values used to invoke the method.
</p>

<div class="org-src-container">
<pre class="src src-java">System.out.println(Math.pow(2, 3)); // Displays 8.0
System.out.println(Math.pow(4, 0.5)); // Displays 2.0
System.out.println(Math.pow(2.5, 2)); // Displays 6.25
System.out.println(Math.pow(2.5, –2)); // Displays 0.16
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">exp(x)</td>
<td class="org-left">Returns e raised to the power of x (e<sup>x</sup>).</td>
<td class="org-left">Math.exp(1) → 2.718281828459045</td>
</tr>

<tr>
<td class="org-left">log(x)</td>
<td class="org-left">Returns the natural logarithm of x (ln x).</td>
<td class="org-left">Math.log(Math.E) → 1.0</td>
</tr>

<tr>
<td class="org-left">log10(x)</td>
<td class="org-left">Returns the base-10 logarithm of x.</td>
<td class="org-left">Math.log10(100) → 2.0</td>
</tr>

<tr>
<td class="org-left">pow(a, b)</td>
<td class="org-left">Returns a raised to the power of b (a<sup>b</sup>).</td>
<td class="org-left">Math.pow(2, 3) → 8.0</td>
</tr>

<tr>
<td class="org-left">sqrt(x)</td>
<td class="org-left">Returns the square root of x (x ≥ 0).</td>
<td class="org-left">Math.sqrt(16) → 4.0</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</body>
</html>
